<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>3.1.Chip Set</title><link rel="stylesheet" type="text/css" href="../recursos/hojas_de_estilo/index.css"></link>
	</head>
	<body>	
		<div class="arriba">
			<div class="Header2">
			<ul><li><a class="inicio" href="../index.html">Inicio</a></li></ul>
			<ul>
				<li class="principal"><a>
					Unidad I</a>
					<ul>
						<li ><a class="subtema">1.1.Modelos de arquitectura de computadora</a>
							<ul>
								<li><a href="../unidad_1/1.1.1.ArquitecturasClasicas.html">Cl치sicas</a></li>
								<li><a href="../unidad_1/1.1.2.ArquitecturasSegmentadas.html">Segmentadas</a></li>
								<li><a href="../unidad_1/1.1.3.Arquitecturas_de_multiprocesamiento.html">Multiprocesamiento</a></li>
							</ul>
						</li>
						<li><a class="subtema">1.2.An&aacute;lisis de componentes</a>
							<ul>
								<li><a href="../unidad_1/1.2.1.UnidadCentralDeProcesamiento.html">
									Unidad Central de Procesamiento</a>
								</li>
								<li><a href="../unidad_1/1.2.2.Memoria.html">
									Memoria</a>
								</li>
								<li><a href="../unidad_1/1.2.3.Manejo de la entrada_salida.html">
									Manejo Entrada/Salida</a>
								</li>
								<li><a href="../unidad_1/1.2.4.Buses.html">Buses</a>
								</li>
								<li><a href="../unidad_1/1.2.5.Interrupciones.html">Interrupciones</a>
								</li>
							</ul>
						</li>
					</ul>
				</li>
			</ul>
			
			<ul>
				<li class="principal"><a>
					Unidad II</a>
					<ul>
					  <li><a class="subtema">
						Estructura y funcionamiento de la Unidad Central de Procesamiento</a>
						<ul>
							<li><a href="../unidad_2/2.1.Oranizacion_del_procesador.html">
								Organizaci&oacute;n del procesador</a>
							</li>
							<li><a href="../unidad_2/2.2.Estructura_de_registros.html">
								Estructura de registros</a>
							</li>
							<li><a href="../unidad_2/2.3.El_ciclo_de_instruccion.html">
								El ciclo de la instrucci&oacute;n</a>
							</li>
						</ul>
					  </li>
					</ul>
				</li>
			</ul>
			
			<ul>
				<li class="principal"><a>
					Unidad III</a>
					<ul>
						<li><a class="subtema">
							Selecci&oacute;n de componentes para ensamble de equipos de c&oacute;mputo</a>
							<ul>
								<li><a href="3.1.Chip_Set.html">Chip set</a></li>
								<li><a href="3.2.Aplicaciones.html">Aplicaciones</a></li>
								<li><a href="3.3.Ambiente_de_servicio.html">Ambientes de servicio</a></li>
							</ul>
						</li>
					</ul>
				</li>
			</ul>
			
			<ul>
				<li class="principal"><a>
					Unidad IV</a>
					<ul>
						<li><a class="subtema">
							Procesamiento paralelo</a>
							<ul>
								<li><a href="../unidad_4/4.1.Aspectos_basicos_de_la_computacion.html">
									Aspectos b&aacute;sicos de la computaci&oacute;n paralela</a>
								</li>
								<li><a href="../unidad_4/4.2.Tipos_de_computaci칩n_paralela.html">
									Tipos de computaci&oacute;n paralela</a>
								</li>
								<li><a href="../unidad_4/4.3.Sistema_de_memoria_compartida_multiprocesamiento.html">
									Sistema de memoria; multiprocesamiento</a>
								</li>
								<li><a href="../unidad_4/4.4.Sistemas_de_memoria_distribuida_multicomputadoras_clusters.html">
									Sistemas de memoria distribuida; multicomputadoras</a>
								</li>
							</ul>
						</li>
					</ul>
				</li>
			</ul>
			</div>
		</div>	
		
		<div class="centrado">
			<h1>Unidad III</h1>
			<hr>
			<h3>3.Selecci&oacute;n de componentes para ensamble de equipos de c&oacute;mputo</h3>
			<hr>
			<h5>3.1.Chip Set</h5>
			<p>
				Un chipset (traducido como circuito integrado auxiliar) es el conjunto de circuitos integrados dise&ntilde;ados con base en la arquitectura de un procesador (en algunos casos, dise&ntilde;ados como parte integral de esa arquitectura), permitiendo que ese tipo de procesadores funcionen en una placa base. Sirven de puente de comunicaci&oacute;n con el resto de componentes de la placa, como son la memoria, las tarjetas de expansi&oacute;n, los puertos USB, rat&oacute;n, teclado, etc.
				Las placas base modernas suelen incluir dos integrados, denominados puente norte y puente sur, y suelen ser los circuitos integrados m&aacute;s grandes despu&eacute;s de la GPU y el microprocesador. Las &uacute;ltimas placa base carecen de puente norte, ya que los procesadores de &uacute;ltima generaci&oacute;n lo llevan integrado.
				El chipset determina muchas de las caracter&iacute;sticas de una placa base y por lo general la referencia de la misma est&aacute; relacionada con la del chipset.
				A diferencia del microcontrolador, el procesador no tiene mayor funcionalidad sin el soporte de un chipset: la importancia del mismo ha sido relegada a un segundo plano por las estrategias de mercadotecnia.
				El Chipset es el que hace posible que la placa base funcione como eje del sistema, dando soporte a varios componentes e interconect&aacute;ndolos de forma que se comuniquen entre ellos haciendo uso de diversos buses. Es uno de los pocos elementos que tiene conexi&oacute;n directa con el procesador, gestiona la mayor parte de la informaci&oacute;n que entra y sale por el bus principal del procesador, del sistema de v&iacute;deo y muchas veces de la memoria RAM.
				En el caso de los computadores PC, es un esquema de arquitectura abierta que establece modularidad: el Chipset debe tener interfaces est&aacute;ndar para los dem&aacute;s dispositivos. Esto permite escoger entre varios dispositivos est&aacute;ndar, por ejemplo en el caso de los buses de expansi&oacute;n, algunas tarjetas madre pueden tener bus PCI-Express y soportar diversos tipos de tarjetas de distintos anchos de bus (1x, 8x, 16x).
				En el caso de equipos port&aacute;tiles o de marca, el chipset puede ser dise&ntilde;ado a la medida y aunque no soporte gran variedad de tecnolog&iacute;as, presentar&aacute; alguna interfaz de dispositivo.
			</p>
			<div class="imagen"><img src="images/HUB.jpg"></img></div>
			<p>
				La terminolog&iacute;a de los integrados ha cambiado desde que se cre&oacute; el concepto del chipset a principio de los a&ntilde;os 1990, pero todav&iacute;a existe equivalencia haciendo algunas aclaraciones:
				El puente norte, northbridge, MCH (memory controller hub) o GMCH (graphic MCH), se usa como puente de enlace entre el microprocesador y la memoria. Controla las funciones de acceso hacia y entre el microprocesador, la memoria RAM, el puerto gr&aacute;fico AGP o el PCI-Express de gr&aacute;ficos, y las comunicaciones con el puente sur. Al principio ten&iacute;a tambi&eacute;n el control de PCI, pero esa funcionalidad ha pasado al puente sur.
				El puente sur, southbridge o ICH (input controller hub), controla los dispositivos asociados como son la controladora de discos IDE, puertos USB, FireWire, SATA, RAID, ranuras PCI, ranura AMR, ranura CNR, puertos infrarrojos, disquetera, LAN, PCI-Express 1x y una larga lista de todos los elementos que podamos imaginar integrados en la placa madre. Es el encargado de comunicar el procesador con el resto de los perif&eacute;ricos.
				En la actualidad los principales fabricantes de chipsets son AMD, ATI Technologies (comprada en 2006 por AMD), Intel, NVIDIA, Silicon Integrated Systems y VIA Technologies.
			</p>
			<div class="siguiente"><a href="3.2.Aplicaciones.html">Siguiente</a></div>
			<div class="abajo">
				<p>Dise&ntilde;ado por:</p>
				<p>Alumna: Gabriela Gonz치lez Gonz치lez<br>

No.Control:18052288<br>

Clase: Arquitectura de las computadoras <br>
Semestre:Enero-Julio 2020<br>
Hora clase: 5:00pm-6:00pm</p><br>
				
			</div>
		</div>
	</body>
</html>