<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>3.3.Ambientes de servicio</title><link rel="stylesheet" type="text/css" href="../recursos/hojas_de_estilo/index.css"></link>
	</head>
	<body>
		<div class="arriba">
			<div class="Header2">
			<ul><li><a class="inicio" href="../index.html">Inicio</a></li></ul>
			<ul>
				<li class="principal"><a>
					Unidad I</a>
					<ul>
						<li ><a class="subtema">1.1.Modelos de arquitectura de computadora</a>
							<ul>
								<li><a href="../unidad_1/1.1.1.ArquitecturasClasicas.html">Clásicas</a></li>
								<li><a href="../unidad_1/1.1.2.ArquitecturasSegmentadas.html">Segmentadas</a></li>
								<li><a href="../unidad_1/1.1.3.Arquitecturas_de_multiprocesamiento.html">Multiprocesamiento</a></li>
							</ul>
						</li>
						<li><a class="subtema">1.2.An&aacute;lisis de componentes</a>
							<ul>
								<li><a href="../unidad_1/1.2.1.UnidadCentralDeProcesamiento.html">
									Unidad Central de Procesamiento</a>
								</li>
								<li><a href="../unidad_1/1.2.2.Memoria.html">
									Memoria</a>
								</li>
								<li><a href="../unidad_1/1.2.3.Manejo de la entrada_salida.html">
									Manejo Entrada/Salida</a>
								</li>
								<li><a href="../unidad_1/1.2.4.Buses.html">Buses</a>
								</li>
								<li><a href="../unidad_1/1.2.5.Interrupciones.html">Interrupciones</a>
								</li>
							</ul>
						</li>
					</ul>
				</li>
			</ul>
			
			<ul>
				<li class="principal"><a>
					Unidad II</a>
					<ul>
					  <li><a class="subtema">
						Estructura y funcionamiento de la Unidad Central de Procesamiento</a>
						<ul>
							<li><a href="../unidad_2/2.1.Oranizacion_del_procesador.html">
								Organizaci&oacute;n del procesador</a>
							</li>
							<li><a href="../unidad_2/2.2.Estructura_de_registros.html">
								Estructura de registros</a>
							</li>
							<li><a href="../unidad_2/2.3.El_ciclo_de_instruccion.html">
								El ciclo de la instrucci&oacute;n</a>
							</li>
						</ul>
					  </li>
					</ul>
				</li>
			</ul>
			
			<ul>
				<li class="principal"><a>
					Unidad III</a>
					<ul>
						<li><a class="subtema">
							Selecci&oacute;n de componentes para ensamble de equipos de c&oacute;mputo</a>
							<ul>
								<li><a href="3.1.Chip_Set.html">Chip set</a></li>
								<li><a href="3.2.Aplicaciones.html">Aplicaciones</a></li>
								<li><a href="3.3.Ambiente_de_servicio.html">Ambientes de servicio</a></li>
							</ul>
						</li>
					</ul>
				</li>
			</ul>
			
			<ul>
				<li class="principal"><a>
					Unidad IV</a>
					<ul>
						<li><a class="subtema">
							Procesamiento paralelo</a>
							<ul>
								<li><a href="../unidad_4/4.1.Aspectos_basicos_de_la_computacion.html">
									Aspectos b&aacute;sicos de la computaci&oacute;n paralela</a>
								</li>
								<li><a href="../unidad_4/4.2.Tipos_de_computación_paralela.html">
									Tipos de computaci&oacute;n paralela</a>
								</li>
								<li><a href="../unidad_4/4.3.Sistema_de_memoria_compartida_multiprocesamiento.html">
									Sistema de memoria; multiprocesamiento</a>
								</li>
								<li><a href="../unidad_4/4.4.Sistemas_de_memoria_distribuida_multicomputadoras_clusters.html">
									Sistemas de memoria distribuida; multicomputadoras</a>
								</li>
							</ul>
						</li>
					</ul>
				</li>
			</ul>
			</div>
		</div>	
		
		<div class="centrado">
			<h1>Unidad III</h1>
			<hr>
			<h3>3.Selecci&oacute;n de componentes para ensamble de equipos de c&oacute;mputo</h3>
			<hr>
			<h5>3.3.Ambientes de servicio</h5>
			<p>
				El negocio de proveer servicios de datos es mucho m&aacute;s complejo que la forma en la que se dan los tradicionales servicios, que con frecuencia se terminan involucrando o necesitando la colaboraci&oacute;n de terceras empresas.
			</p>
			<ul>
				<li>Desarrollo de nuevos mercados y productos.</li>
				<li>Adquisici&oacute;n y administraci&oacute;n de clientes.</li>
				<li>Proveer y desarrollar servicios para la red.</li>
				<li>Administraci&oacute;n del negocio.</li>
			</ul><br><br><br><br>
			<h6>Negocios</h6>
			<p>
				Definitivamente, la tecnolog&iacute;a en general ha sido la causa principal y la acci&oacute;n m&aacute;s directa para la transformaci&oacute;n del trabajo de las organizaciones en la posguerra del siglo XX. Tanto los bienes de capital «duros» (computadores, tel&eacute;fonos, videos, facs&iacute;miles, grabadoras, etc.), como los programas y sistemas de informaci&oacute;n y comunicaci&oacute;n en general, han incrementado enormemente la productividad y eficiencia de las organizaciones. Tenemos como ejemplos los siguientes: bases de datos en redes de todo orden y topolog&iacute;a, sistemas de reservaciones en aerol&iacute;neas, sistemas de contabilidad y n&oacute;minas, archivos cl&iacute;nicos en centros de salud, sistemas de conmutaci&oacute;n electr&oacute;nica y un sin n&uacute;mero de otras aplicaciones a procesos administrativos.
			</p>
			<h6>Industria</h6>
			<p>
				La industrializaci&oacute;n de los servicios de tecnolog&iacute;a de informaci&oacute;n va a redefinir el mercado en t&eacute;rminos de como las organizaciones eval&uacute;an, compran y seleccionan los servicios y como los vendedores desarrollan y establecen precios de los servicios. Para lograr esta estandarizaci&oacute;n, se requiere un enfoque hacia las soluciones gen&eacute;ricas y esto debe ser responsabilidad de los proveedores, que deben de desarrollar, operar y administrar el resultado de estos gen&eacute;ricos de TI.  Aunque los servicios de TI est&aacute;n en proceso de madurez, la madurez de la industria se ha incrementado en aspectos evidentes, como la forma en que los servicios son implementados y administrados.
			</p>
			<h6>Comercio electr&oacute;nico</h6>
			<p>
				El desarrollo de estas tecnolog&iacute;as y de las telecomunicaciones ha hecho que los intercambios de datos crezcan a niveles extraordinarios, simplific&aacute;ndose cada vez m&aacute;s y creando nuevas formas de comercio, y en este marco se desarrolla el Comercio Electr&oacute;nico. Se considera “Comercio Electr&oacute;nico” al conjunto de aquellas transacciones comerciales y financieras realizadas a trav&eacute;s del procesamiento y la transmisi&oacute;n de informaci&oacute;n, incluyendo texto, sonido e imagen.
			</p>
			<div class="atras"><a href="3.2.Aplicaciones.html">Atrás</a></div>
			<div class="abajo">
				<p>Dise&ntilde;ado por:</p>
				<p>Alumna: Gabriela González González<br>

No.Control:18052288<br>

Clase: Arquitectura de las computadoras <br>
Semestre:Enero-Julio 2020<br>
Hora clase: 5:00pm-6:00pm</p><br>
			
			</div>
		</div>
	</body>
</html>